package HomeWork01;

public class HW01Task01 {
    public static void main(String[] args) {
        int result = 0; // переменная для результатов унарных операций с присваиванием

        /* 1.2 */
        //******* Побитовый унарный оператор NOT *******//
        // 42: 00101010
        //~42: 11010101
        System.out.println("~42 = " + ~42);
        // 15: 00001111
        //~15: 11110000
        System.out.println("~15 = " + ~15);

        //******* Побитовый AND *******//
        //   00101010
        // & 00001111
        // ----------
        //   00001010
        System.out.println("42 & 15 = " + (42 & 15));

        //******* Побитовый AND с присваиванием *******//
        //   00101010
        // & 00001111
        // ----------
        //   00001010
        result = 42;
        System.out.println("result = " + result);
        result &= 15;
        System.out.println("result &= 15: " + result);

        //******* Побитовый OR *******//
        //   00101010
        // | 00001111
        // ----------
        //   00101111
        System.out.println("42 | 15 = " + (42 | 15));

        //******* Побитовый OR с присваиванием *******//
        //   00101010
        // | 00001111
        // ----------
        //   00001010
        result = 42;
        System.out.println("result = " + result);
        result |= 15;
        System.out.println("result |= 15: " + result);

        //******* Побитовый XOR *******//
        //   00101010
        // ^ 00001111
        // ----------
        //   00100101
        System.out.println("42 ^ 15 = " + (42 ^ 15));

        //******* Побитовый XOR с присваиванием *******//
        //   00101010
        // ^ 00001111
        // ----------
        //   00001010
        result = 42;
        System.out.println("result = " + result);
        result ^= 15;
        System.out.println("result ^= 15: " + result);

        //******* Сдвиг вправо *******//
        // 42    : 00101010
        // 42>>15: 00000000
        System.out.println("42 >> 15 = " + (42 >> 15));
        // 15    : 00001111
        // 15>>15: 00000000
        System.out.println("15 >> 15 = " + (15 >> 15));

        //******* Сдвиг вправо с присваиванием *******//
        // 42    : 00101010
        // 42>>15: 00000000
        result = 42;
        System.out.println("result = " + result);
        System.out.println("result >>= 15: " + (result >>= 15));
        // 15    : 00001111
        // 15>>15: 00000000
        result = 15;
        System.out.println("result = " + result);
        System.out.println("result >>= 15: " + (result >>= 15));

        //******* Сдвиг вправо с заполнением нулями *******//
        // 42     : 00101010
        // 42>>>15: 00000000
        System.out.println("42 >>> 15 = " + (42 >>> 15));
        // 15     : 00001111
        // 15>>>15: 00000000
        System.out.println("15 >>> 15 = " + (15 >>> 15));

        //******* Сдвиг вправо с заполнением нулями с присваиванием *******//
        // 42     : 00101010
        // 42>>>15: 00000000
        result = 42;
        System.out.println("result = " + result);
        System.out.println("result >>>= 15: " + (result >>>= 15));
        // 15     : 00001111
        // 15>>>15: 00000000
        result = 15;
        System.out.println("result = " + result);
        System.out.println("result >>>= 15: " + (result >>>= 15));

        //******* Сдвиг влево *******//
        // 42    : 00000000000000000101010
        // 42<<15: 00101010000000000000000
        System.out.println("42 << 15 = " + (42 << 15));
        // 15    : 00000000000000000001111
        // 15<<15: 00001111000000000000000
        System.out.println("15 << 15 = " + (15 << 15));

        //******* Сдвиг влево с присваиванием *******//
        // 42    : 00101010
        // 42<<15: 00000000
        result = 42;
        System.out.println("result = " + result);
        System.out.println("result <<= 15: " + (result <<= 15));
        // 15    : 00001111
        // 15<<15: 00000000
        result = 15;
        System.out.println("result = " + result);
        System.out.println("result <<= 15: " + (result <<= 15));

        /* 1.3 */
        //******* Побитовый унарный оператор NOT *******//
        // -42: 11111111111111111111111111010110
        //~-42: 00000000000000000000000000101001
        System.out.println("~(-42) = " + ~-42);
        // -15: 11111111111111111111111111110001
        //~-15: 00000000000000000000000000001110
        System.out.println("~(-15) = " + ~-15);

        //******* Побитовый AND *******//
        //   11111111111111111111111111010110
        // & 11111111111111111111111111110001
        // ----------
        //   11111111111111111111111111010000
        System.out.println("-42 & -15 = " + (-42 & -15));

        //******* Побитовый AND с присваиванием *******//
        //   11111111111111111111111111010110
        // & 11111111111111111111111111110001
        // ----------
        //   11111111111111111111111111010000
        result = -42;
        System.out.println("result = " + result);
        result &= -15;
        System.out.println("result &= -15: " + result);

        //******* Побитовый OR *******//
        //   11111111111111111111111111010110
        // | 11111111111111111111111111110001
        // ----------
        //   11111111111111111111111111110111
        System.out.println("-42 | -15 = " + (-42 | -15));

        //******* Побитовый OR с присваиванием *******//
        //   11111111111111111111111111010110
        // | 11111111111111111111111111110001
        // ----------
        //   11111111111111111111111111110111
        result = -42;
        System.out.println("result = " + result);
        result |= -15;
        System.out.println("result |= -15: " + result);

        //******* Побитовый XOR *******//
        //   11111111111111111111111111010110
        // ^ 11111111111111111111111111110001
        // ----------
        //   00000000000000000000000000100111
        System.out.println("-42 ^ -15 = " + (-42 ^ -15));

        //******* Побитовый XOR с присваиванием *******//
        //   11111111111111111111111111010110
        // ^ 11111111111111111111111111110001
        // ----------
        //   00000000000000000000000000100111
        result = -42;
        System.out.println("result = " + result);
        result ^= -15;
        System.out.println("result ^= -15: " + result);

        //******* Сдвиг вправо *******//
        // -42     : 11111111111111111111111111010110
        // -42>>15 : 11111111111111111111111111111111
        System.out.println("-42 >> 15 = " + (-42 >> 15));
        // -15     : 11111111111111111111111111110001
        // -15>>15 : 11111111111111111111111111111111
        System.out.println("-15 >> 15 = " + (-15 >> 15));

        //******* Сдвиг вправо с присваиванием *******//
        // -42    : 11111111111111111111111111010110
        // -42>>15: 11111111111111111111111111111111
        result = -42;
        System.out.println("result = " + result);
        System.out.println("result >>= 15: " + (result >>= 15));
        // -15    : 11111111111111111111111111110001
        // -15>>15: 11111111111111111111111111111111
        result = -15;
        System.out.println("result = " + result);
        System.out.println("result >>= 15: " + (result >>= 15));

        //******* Сдвиг вправо с заполнением нулями *******//
        // -42     : 11111111111111111111111111010110
        // -42>>>15: 00000000000000011111111111111111
        System.out.println("-42 >>> 15 = " + (-42 >>> 15));
        // -15     : 11111111111111111111111111110001
        // -15>>>15: 00000000000000011111111111111111
        System.out.println("-15 >>> 15 = " + (-15 >>> 15));

        //******* Сдвиг вправо с заполнением нулями с присваиванием *******//
        // -42     : 11111111111111111111111111010110
        // -42>>>15: 00000000000000011111111111111111
        result = -42;
        System.out.println("result = " + result);
        System.out.println("result >>>= 15: " + (result >>>= 15));
        // -15     : 11111111111111111111111111110001
        // -15>>>15: 00000000000000011111111111111111
        result = -15;
        System.out.println("result = " + result);
        System.out.println("result >>>= 15: " + (result >>>= 15));

        //******* Сдвиг влево *******//
        // -42    : 11111111111111111111111111010110
        // -42<<15: 11111111111010110000000000000000
        System.out.println("-42 << 15 = " + (-42 << 15));
        // -15    : 11111111111111111111111111110001
        // -15<<15: 11111111111110001000000000000000
        System.out.println("-15 << 15 = " + (-15 << 15));

        //******* Сдвиг влево с присваиванием *******//
        // -42    : 11111111111111111111111111010110
        // -42<<15: 11111111111010110000000000000000
        result = -42;
        System.out.println("result = " + result);
        System.out.println("result <<= 15: " + (result <<= 15));
        // -15    : 11111111111111111111111111110001
        // -15<<15: 11111111111110001000000000000000
        result = -15;
        System.out.println("result = " + result);
        System.out.println("result <<= 15: " + (result <<= 15));

        /* 1.5 */
        //System.out.println("~42.5 = " + ~42.5); // bad operand type double for unary operator '~'
    }
}
